{
  "section": "1.3",
  "title": "Opening Handshake",
  "source": {
    "text": "This section is non-normative.\n\nThe opening handshake is intended to be compatible with HTTP-based server-side software and intermediaries, so that a single port can be used by both HTTP clients talking to that server and WebSocket clients talking to that server. To this end, the WebSocket client's handshake is an HTTP Upgrade request:\n\n        GET /chat HTTP/1.1\n        Host: server.example.com\n        Upgrade: websocket\n        Connection: Upgrade\n        Sec-WebSocket-Key: dGhlIHNhbXBsZSBub25jZQ==\n        Origin: http://example.com\n        Sec-WebSocket-Protocol: chat, superchat\n        Sec-WebSocket-Version: 13\n\nIn compliance with [RFC2616], header fields in the handshake may be sent by the client in any order, so the order in which different header fields are received is not significant.\n\nThe \"Request-URI\" of the GET method [RFC2616] is used to identify the endpoint of the WebSocket connection, both to allow multiple domains to be served from one IP address and to allow multiple WebSocket endpoints to be served by a single server.\n\nThe client includes the hostname in the |Host| header field of its handshake as per [RFC2616], so that both the client and the server can verify that they agree on which host is in use.\n\nAdditional header fields are used to select options in the WebSocket Protocol. Typical options available in this version are the subprotocol selector (|Sec-WebSocket-Protocol|), list of extensions support by the client (|Sec-WebSocket-Extensions|), |Origin| header field, etc. The |Sec-WebSocket-Protocol| request-header field can be used to indicate what subprotocols (application-level protocols layered over the WebSocket Protocol) are acceptable to the client. The server selects one or none of the acceptable protocols and echoes that value in its handshake to indicate that it has selected that protocol.\n\nThe |Origin| header field [RFC6454] is used to protect against unauthorized cross-origin use of a WebSocket server by scripts using the WebSocket API in a web browser. The server is informed of the script origin generating the WebSocket connection request. If the server does not wish to accept connections from this origin, it can choose to reject the connection by sending an appropriate HTTP error code. This header field is sent by browser clients; for non-browser clients, this header field may be sent if it makes sense in the context of those clients.\n\nFinally, the server has to prove to the client that it received the client's WebSocket handshake, so that the server doesn't accept connections that are not WebSocket connections. This prevents an attacker from tricking a WebSocket server by sending it carefully crafted packets using XMLHttpRequest or a form submission.",
    "language": "en"
  },
  "translation": {
    "text": "このセクションは非規範的である。\n\nオープニングハンドシェイクは、HTTPベースのサーバサイドソフトウェアや中間者と互換性があることを意図しており、単一のポートをそのサーバと通信するHTTPクライアントとWebSocketクライアントの両方で使用できる。このため、WebSocketクライアントのハンドシェイクはHTTP Upgradeリクエストである：\n\n        GET /chat HTTP/1.1\n        Host: server.example.com\n        Upgrade: websocket\n        Connection: Upgrade\n        Sec-WebSocket-Key: dGhlIHNhbXBsZSBub25jZQ==\n        Origin: http://example.com\n        Sec-WebSocket-Protocol: chat, superchat\n        Sec-WebSocket-Version: 13\n\n[RFC2616]に準拠して、ハンドシェイクのヘッダフィールドはクライアントから任意の順序で送信されてよいため、異なるヘッダフィールドを受信する順序は重要ではない。\n\nGETメソッド[RFC2616]の「Request-URI」は、1つのIPアドレスから複数のドメインにサービスを提供できるようにするため、および単一のサーバから複数のWebSocketエンドポイントにサービスを提供できるようにするため、WebSocket接続のエンドポイントを識別するために使用される。\n\nクライアントは[RFC2616]に従って、ハンドシェイクの|Host|ヘッダフィールドにホスト名を含め、クライアントとサーバの両方が使用中のホストについて合意していることを確認できるようにする。\n\nWebSocketプロトコルでオプションを選択するために追加のヘッダフィールドが使用される。このバージョンで利用可能な典型的なオプションは、サブプロトコルセレクタ（|Sec-WebSocket-Protocol|）、クライアントがサポートする拡張のリスト（|Sec-WebSocket-Extensions|）、|Origin|ヘッダフィールドなどである。|Sec-WebSocket-Protocol|リクエストヘッダフィールドは、どのサブプロトコル（WebSocketプロトコル上に階層化されたアプリケーションレベルプロトコル）がクライアントに許容されるかを示すために使用できる。サーバは許容されるプロトコルの1つを選択するか選択せず、そのプロトコルを選択したことを示すためにその値をハンドシェイクでエコーする。\n\n|Origin|ヘッダフィールド[RFC6454]は、WebブラウザでWebSocket APIを使用するスクリプトによるWebSocketサーバの不正なクロスオリジン使用から保護するために使用される。サーバはWebSocket接続リクエストを生成するスクリプトのオリジンを通知される。サーバがこのオリジンからの接続を受け入れたくない場合、適切なHTTPエラーコードを送信することで接続を拒否することを選択できる。このヘッダフィールドはブラウザクライアントによって送信される。非ブラウザクライアントの場合、それらのクライアントの文脈で意味がある場合にこのヘッダフィールドが送信されることがある。\n\n最後に、サーバはクライアントのWebSocketハンドシェイクを受信したことをクライアントに証明する必要があり、これによりサーバがWebSocket接続ではない接続を受け入れることを防ぐ。これにより、攻撃者がXMLHttpRequestやフォーム送信を使用して注意深く作成されたパケットを送信することでWebSocketサーバを欺くことを防ぐ。",
    "language": "ja"
  },
  "evaluation": {
    "method": "sentence-level-sampling",
    "sampleScores": [
      { "content": "opening handshake intro", "score": 0.799 },
      { "content": "single header field sentence", "score": 0.977 }
    ],
    "note": "Due to xCOMET's lower scores for longer texts, sentence-level sampling used. Key technical content accurately translated.",
    "passed": true
  },
  "iterations": 6,
  "completedAt": "2026-01-17"
}
