{
  "section": "1.2",
  "title": "Protocol Overview",
  "source": {
    "text": "This section is non-normative.\n\nThe protocol has two parts: a handshake and the data transfer.\n\nThe handshake from the client looks as follows:\n\n        GET /chat HTTP/1.1\n        Host: server.example.com\n        Upgrade: websocket\n        Connection: Upgrade\n        Sec-WebSocket-Key: dGhlIHNhbXBsZSBub25jZQ==\n        Origin: http://example.com\n        Sec-WebSocket-Protocol: chat, superchat\n        Sec-WebSocket-Version: 13\n\nThe handshake from the server looks as follows:\n\n        HTTP/1.1 101 Switching Protocols\n        Upgrade: websocket\n        Connection: Upgrade\n        Sec-WebSocket-Accept: s3pPLMBiTxaQ9kYGzzhZRbK+xOo=\n        Sec-WebSocket-Protocol: chat\n\nThe leading line from the client follows the Request-Line format. The leading line from the server follows the Status-Line format. The Request-Line and Status-Line productions are defined in [RFC2616].\n\nAn unordered set of header fields comes after the leading line in both cases. The meaning of these header fields is specified in Section 4 of this document. Additional header fields may also be present, such as cookies [RFC6265]. The format and parsing of headers is as defined in [RFC2616].\n\nOnce the client and server have both sent their handshakes, and if the handshake was successful, then the data transfer part starts. This is a two-way communication channel where each side can, independently from the other, send data at will.\n\nAfter a successful handshake, clients and servers transfer data back and forth in conceptual units referred to in this specification as \"messages\". On the wire, a message is composed of one or more frames. The WebSocket message does not necessarily correspond to a particular network layer framing, as a fragmented message may be coalesced or split by an intermediary.\n\nA frame has an associated type. Each frame belonging to the same message contains the same type of data. Broadly speaking, there are types for textual data (which is interpreted as UTF-8 [RFC3629] text), binary data (whose interpretation is left up to the application), and control frames (which are not intended to carry data for the application but instead for protocol-level signaling, such as to signal that the connection should be closed). This version of the protocol defines six frame types and leaves ten reserved for future use.",
    "language": "en"
  },
  "translation": {
    "text": "このセクションは非規範的である。\n\nプロトコルはハンドシェイクとデータ転送の2つの部分から構成される。\n\nクライアントからのハンドシェイクは以下のようになる：\n\n        GET /chat HTTP/1.1\n        Host: server.example.com\n        Upgrade: websocket\n        Connection: Upgrade\n        Sec-WebSocket-Key: dGhlIHNhbXBsZSBub25jZQ==\n        Origin: http://example.com\n        Sec-WebSocket-Protocol: chat, superchat\n        Sec-WebSocket-Version: 13\n\nサーバからのハンドシェイクは以下のようになる：\n\n        HTTP/1.1 101 Switching Protocols\n        Upgrade: websocket\n        Connection: Upgrade\n        Sec-WebSocket-Accept: s3pPLMBiTxaQ9kYGzzhZRbK+xOo=\n        Sec-WebSocket-Protocol: chat\n\nクライアントからの先頭行はRequest-Line形式に従う。サーバからの先頭行はStatus-Line形式に従う。Request-LineおよびStatus-Lineの構文は[RFC2616]で定義されている。\n\nどちらの場合も、先頭行の後に順序付けされていないヘッダフィールドのセットが続く。これらのヘッダフィールドの意味は本文書のセクション4で規定されている。クッキー[RFC6265]などの追加ヘッダフィールドも存在する場合がある。ヘッダの書式と解析は[RFC2616]で定義されているとおりである。\n\nクライアントとサーバの両方がハンドシェイクを送信し、ハンドシェイクが成功すると、データ転送部分が開始される。これは双方向通信チャネルであり、各側が他方とは独立して自由にデータを送信できる。\n\nハンドシェイクが成功すると、クライアントとサーバは本仕様で「メッセージ」と呼ばれる概念単位でデータをやり取りする。ワイヤ上では、メッセージは1つ以上のフレームで構成される。断片化されたメッセージは中間者によって結合または分割される可能性があるため、WebSocketメッセージは必ずしも特定のネットワーク層フレーミングに対応するとは限らない。\n\nフレームには関連付けられた型がある。同じメッセージに属する各フレームは同じ型のデータを含む。大まかに言えば、テキストデータ（UTF-8 [RFC3629]テキストとして解釈される）、バイナリデータ（その解釈はアプリケーションに委ねられる）、および制御フレーム（アプリケーション用のデータを運ぶことを意図しておらず、代わりに接続を閉じるべきことを通知するなどのプロトコルレベルのシグナリング用）の型がある。このバージョンのプロトコルでは6種類のフレーム型を定義し、将来の使用のために10種類を予約している。",
    "language": "ja"
  },
  "evaluation": {
    "method": "paragraph-level",
    "paragraphScores": [
      { "paragraph": 1, "score": 0.9, "content": "intro" },
      { "paragraph": 2, "score": 0.847, "content": "data transfer start" },
      { "paragraph": 3, "score": 0.859, "content": "messages and frames" },
      { "paragraph": 4, "score": 0.925, "content": "frame types" }
    ],
    "averageScore": 0.883,
    "passed": true
  },
  "iterations": 1,
  "completedAt": "2026-01-17"
}
